## PIVOT TABLE

In [2]:
import numpy as np
import pandas as pd

In [3]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['Pankaj', 'Rahul', 'Aditya', 'Ayush', 'Pankaj', 'Rahul', 'Aditya', 'Ayush', 'Pankaj', 'Rahul',
            'Aditya', 'Ayush', 'Pankaj', 'Rahul', 'Aditya', 'Ayush', 'Pankaj', 'Rahul', 'Aditya', 'Ayush']
}

df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units     Rep    Month Quarter
0  2023-01-01       A   East    474     22  Pankaj  January      Q1
1  2023-01-02       B   West    553     46   Rahul  January      Q1
2  2023-01-03       C  North    115     41  Aditya  January      Q1
3  2023-01-04       D  South    601     11   Ayush  January      Q1
4  2023-01-05       A   East    310     66  Pankaj  January      Q1
5  2023-01-06       B   West    478     31   Rahul  January      Q1
6  2023-01-07       C  North    704     16  Aditya  January      Q1
7  2023-01-08       D  South    673     65   Ayush  January      Q1
8  2023-01-09       A   East    448     33  Pankaj  January      Q1
9  2023-01-10       B   West    427     40   Rahul  January      Q1
10 2023-01-11       C  North    745     20  Aditya  January      Q1
11 2023-01-12       D  South    317     93   Ayush  January      Q1
12 2023-01-13       A   East    105     77  Pankaj  January      Q1
13 2023-01-14       B   West    670     22   Rahul  January      Q1
14 2023-01-15       C  North    378     61  Aditya  January      Q1
15 2023-01-16       D  South    851     45   Ayush  January      Q1
16 2023-01-17       A   East    937     83  Pankaj  January      Q1
17 2023-01-18       B   West    757     92   Rahul  January      Q1
18 2023-01-19       C  North    856     76  Aditya  January      Q1
19 2023-01-20       D  South    879     59   Ayush  January      Q1

In [4]:
pd.pivot_table(df, values="Sales", index=["Region"], columns=["Product"])

Product      A      B      C      D
Region
East     454.8    NaN    NaN    NaN
North      NaN    NaN  559.6    NaN
South      NaN    NaN    NaN  664.2
West       NaN  577.0    NaN    NaN

In [5]:
pivot2 = pd.pivot_table(df, values=["Sales", "Units"], index="Region", columns=["Product"])
pivot2

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     454.8    NaN    NaN    NaN  56.2   NaN   NaN   NaN
North      NaN    NaN  559.6    NaN   NaN   NaN  42.8   NaN
South      NaN    NaN    NaN  664.2   NaN   NaN   NaN  54.6
West       NaN  577.0    NaN    NaN   NaN  46.2   NaN   NaN

- Cross Tab

In [6]:
pd.crosstab(df["Region"], df["Product"])

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0